docker/.bench_tmp/kachedb_SET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #1)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #1)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #1)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
Thread 2 restarted successfully.
Restarting thread 3 (restart #1)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #2)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #2)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #2)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #2)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #3)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #3)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #3)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #3)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #4)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #4)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #4)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #4)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
Restarting thread 0 (restart #5)...
Thread 0 restarted successfully.
Restarting thread 1 (restart #5)...
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 0 finished due to connection failures, requesting restart.
Thread 1 restarted successfully.
Restarting thread 2 (restart #5)...
Thread 2 restarted successfully.
Restarting thread 3 (restart #5)...
Thread 3 restarted successfully.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 1 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 2 finished due to connection failures, requesting restart.
connection dropped.
Maximum reconnection attempts (0) exceeded for Connection dropped, triggering thread restart.
Thread 3 finished due to connection failures, requesting restart.
[RUN #1 0%,   1 secs]  0 threads 50 conns 4 conn errors:        3936 ops,       0 (avg:    3907) ops/sec, 0.00KB/sec (avg: 423.54KB/sec),   nan (avg:  3.74) msec latency


CPU Utilization Summary
  Total CPU time:   1.986s  (user 0.934s, sys 1.051s)
  Wall time:        0.820s
  Cores used:       2.423   (avg 58.3% across 4 worker threads)
  Peak utilization: 2.5%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---         3.74093         2.00700        27.13500        28.79900         0.00 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals          0.00         0.00         0.00         3.74093         2.00700        27.13500        28.79900         0.00