docker/.bench_tmp/redis_GET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads 50 conns:    20000000 ops,  910642 (avg:  953756) ops/sec, 92.05MB/sec (avg: 96.41MB/sec),  3.51 (avg:  3.35) msec latency


CPU Utilization Summary
  Total CPU time:   32.090s  (user 20.274s, sys 11.815s)
  Wall time:        21.001s
  Cores used:       1.528   (avg 38.2% across 4 worker threads)
  Peak utilization: 164.9%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets       954077.03    954077.03         0.00         3.34987         3.23100         5.88700        14.27100     98755.20 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     954077.03    954077.03         0.00         3.34987         3.23100         5.88700        14.27100     98755.20