docker/.bench_tmp/redis_MIXED.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  21 secs]  0 threads 50 conns:    20000000 ops,  792414 (avg:  928694) ops/sec, 80.86MB/sec (avg: 94.76MB/sec),  4.03 (avg:  3.44) msec latency


CPU Utilization Summary
  Total CPU time:   32.618s  (user 20.671s, sys 11.947s)
  Wall time:        21.567s
  Cores used:       1.512   (avg 37.8% across 4 worker threads)
  Peak utilization: 170.5%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       185827.54          ---          ---         3.44069         3.32700         5.91900        13.75900     20142.12 
Gets       743310.15    743310.15         0.00         3.44035         3.32700         5.91900        13.56700     76939.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     929137.69    743310.15         0.00         3.44042         3.32700         5.91900        13.56700     97081.12