docker/.bench_tmp/redis_SET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  21 secs]  0 threads 50 conns:    20000000 ops,  873412 (avg:  910067) ops/sec, 92.45MB/sec (avg: 96.33MB/sec),  3.66 (avg:  3.51) msec latency


CPU Utilization Summary
  Total CPU time:   39.310s  (user 23.860s, sys 15.449s)
  Wall time:        22.011s
  Cores used:       1.786   (avg 44.6% across 4 worker threads)
  Peak utilization: 206.8%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       910792.35          ---          ---         3.51141         3.42300         6.94300        11.90300     98722.09 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     910792.35         0.00         0.00         3.51141         3.42300         6.94300        11.90300     98722.09