docker/.bench_tmp/valkey_GET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  19 secs]  0 threads 50 conns:    20000000 ops,  998279 (avg: 1036391) ops/sec, 100.91MB/sec (avg: 104.76MB/sec),  3.20 (avg:  3.08) msec latency


CPU Utilization Summary
  Total CPU time:   38.811s  (user 22.780s, sys 16.031s)
  Wall time:        19.389s
  Cores used:       2.002   (avg 50.0% across 4 worker threads)
  Peak utilization: 214.7%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets            0.00          ---          ---             ---             ---             ---             ---         0.00 
Gets      1036892.48   1036892.48         0.00         3.08194         3.07100         5.37500        11.07100    107327.31 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals    1036892.48   1036892.48         0.00         3.08194         3.07100         5.37500        11.07100    107327.31