docker/.bench_tmp/valkey_MIXED.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads 50 conns:    20000000 ops,  948187 (avg:  965006) ops/sec, 96.75MB/sec (avg: 98.47MB/sec),  3.37 (avg:  3.31) msec latency

4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       192961.30          ---          ---         3.31035         3.29500         5.21500        10.68700     20915.36 
Gets       771845.21    771845.21         0.00         3.31056         3.29500         5.21500        10.75100     79892.63 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     964806.51    771845.21         0.00         3.31052         3.29500         5.21500        10.75100    100807.98 

CPU Utilization Summary
  Total CPU time:   39.658s  (user 23.356s, sys 16.302s)
  Wall time:        20.813s
  Cores used:       1.905   (avg 47.6% across 4 worker threads)
  Peak utilization: 206.7%