docker/.bench_tmp/valkey_SET.log
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads 50 conns:    20000000 ops,  914079 (avg:  986686) ops/sec, 96.76MB/sec (avg: 104.44MB/sec),  3.49 (avg:  3.24) msec latency


CPU Utilization Summary
  Total CPU time:   47.270s  (user 26.388s, sys 20.883s)
  Wall time:        20.338s
  Cores used:       2.324   (avg 58.1% across 4 worker threads)
  Peak utilization: 280.2%
4         Threads
50        Connections per thread
100000    Requests per client


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       986162.37          ---          ---         3.23814         3.27900         5.85500         9.66300    106891.55 
Gets            0.00         0.00         0.00             ---             ---             ---             ---         0.00 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     986162.37         0.00         0.00         3.23814         3.27900         5.85500         9.66300    106891.55